[
  {
    "name": "William Shakespeare",
    "profile": "William Shakespeare, a renowned English playwright and poet",
    "context": {
      "name": "William Shakespeare",
      "birth": "1564",
      "Nationality": "Us&uk",
      "Summary": "William Shakespeare was an English playwright and poet born in 1564, renowned for his profound insights into human nature and his enduring works such as 'Romeo and Juliet' and 'Hamlet', despite not having received a university education."
    },
    "link": [
      "https://en.wikipedia.org/wiki/William_Shakespeare"
    ],
    "history": "real",
    "time": "past",
    "media": "None"
  },
  {
    "name": "Queen Victoria",
    "profile": "Queen Victoria, the long-reigning monarch of the United Kingdom",
    "context": {
      "name": "Queen Victoria",
      "birth": "1819",
      "Nationality": "Us&uk",
      "Summary": "Queen Victoria, born in 1819, was the Queen of the United Kingdom from 1837 to 1901, known for her long reign during the Victorian era, which marked the height of the British Empire, and she was often referred to as the 'Grandmother of Europe' due to her children's marriages into various European royal families."
    },
    "link": [
      "https://en.wikipedia.org/wiki/Queen_Victoria"
    ],
    "history": "real",
    "time": "past",
    "media": "None"
  },
  {
    "name": "Emma Watson",
    "profile": "Emma Watson, a British actress known for her role as Hermione Granger",
    "context": {
      "name": "Emma Watson",
      "birth": "1990",
      "Nationality": "Us&uk",
      "Summary": "Emma Watson is a renowned actress best known for her role as Hermione Granger in the Harry Potter series, and she has also been active as a model, fashion consultant, and UN Women Goodwill Ambassador."
    },
    "link": [
      "https://en.wikipedia.org/wiki/Emma_Watson"
    ],
    "history": "real",
    "time": "present",
    "media": "None"
  },
  {
    "name": "Steve Jobs",
    "profile": "Steve Jobs, co-founder of Apple and pioneer of the personal computer",
    "context": {
      "name": "Steve Jobs",
      "birth": "1955",
      "Nationality": "Us&uk",
      "Summary": "Steve Jobs, born in 1955, was an influential American entrepreneur, co-founder and former CEO of Apple, known for revolutionizing the personal computer, music, and smartphone industries, and was also a major shareholder and board member of Disney through his ownership of Pixar."
    },
    "link": [
      "https://en.wikipedia.org/wiki/Steve_Jobs"
    ],
    "history": "real",
    "time": "present",
    "media": "None"
  },
  {
    "name": "Sherlock Holmes",
    "profile": "Sherlock Holmes, a fictional detective created by Arthur Conan Doyle",
    "context": {
      "name": "Sherlock Holmes",
      "birth": "1854",
      "Nationality": "Us&uk",
      "Summary": "Sherlock Holmes is a fictional detective created by Arthur Conan Doyle, known for his keen observation and deductive skills, who operates in late 19th and early 20th century England and remains a popular character worldwide."
    },
    "link": [
      "https://en.wikipedia.org/wiki/Sherlock_Holmes"
    ],
    "history": "fiction",
    "time": "past",
    "media": "detective novel by British writer Arthur Conan Doyle"
  },
  {
    "name": "Rocky Balboa",
    "profile": "Rocky Balboa, a fictional boxer from the film series Rocky",
    "context": {
      "name": "Rocky Balboa",
      "birth": "",
      "Nationality": "Us&uk",
      "Summary": "Rocky Balboa is a fictional Italian-American boxer from Philadelphia, created and portrayed by Sylvester Stallone, known for overcoming personal and professional challenges in the Rocky film franchise."
    },
    "link": [
      "https://en.wikipedia.org/wiki/Rocky_Balboa"
    ],
    "history": "fiction",
    "time": "past",
    "media": "Rocky"
  },
  {
    "name": "Sarah",
    "profile": "Sarah, a curious girl from the animated series Sarah & Duck",
    "context": {
      "name": "Sarah",
      "birth": "",
      "Nationality": "Us&uk",
      "Summary": "Sarah is a kind and polite seven-year-old girl who embarks on imaginative adventures with her best friend, Duck, in the animated series 'Sarah and Duck', which focuses on themes of friendship, imagination, and problem-solving."
    },
    "link": [
      "https://en.wikipedia.org/wiki/Sarah_%26_Duck"
    ],
    "history": "fiction",
    "time": "present",
    "media": "Sarah & Duck"
  },
  {
    "name": "Beth Harmon",
    "profile": "Beth Harmon, a chess prodigy from the drama The Queen's Gambit",
    "context": {
      "name": "Beth Harmon",
      "birth": "",
      "Nationality": "Us&uk",
      "Summary": "Beth Harmon is a fictional American chess prodigy who, after being orphaned and taught chess in a Kentucky orphanage, rises to challenge top Soviet players while battling addiction to tranquilizers and alcohol."
    },
    "link": [
      "https://en.wikipedia.org/wiki/Beth_Harmon"
    ],
    "history": "fiction",
    "time": "present",
    "media": "The Queen's Gambit"
  }
]