[
  {
    "name": "Aesoon",
    "profile": "Aesoon from the Netflix drama When Life Gives You Tangerines",
    "long":"Aesoon Oh is the main character of the drama When Life Gives You Tangerines, set in 1950s Jeju Island. She is portrayed as a girl who never loses sight of her dreams despite a harsh and challenging life. Raised in poverty under a strict mother, she nurtures a love for poetry and possesses a strong will to forge her own path."
  },
  {
    "name": "Giyoung",
    "profile": "Gi-yeong Lee, a character from the Korean comic Black Rubber Shoes",
    "long": "Gi-yeong Lee is the main character of the animated series Black Rubber Shoes, set in the late 1960s in Mapo-gu, Seoul. He is an ordinary boy attending elementary school. Despite living in poverty, he grows up in a warm, large family with his parents, siblings, and grandparents, experiencing deep familial love. Through his friendships, he learns the value of everyday life and builds strong bonds."
  },
  {
    "name": "Sejong",
    "profile": "King Sejong the Great, a historical figure from Korea",
    "long": "King Sejong the Great was a monarch of the early Joseon Dynasty, renowned for his wise and benevolent rule after ascending the throne in 1418. He is celebrated as a ruler who governed with the people’s well-being at heart. Gifted with intelligence from a young age, he promoted advancements across a wide range of fields including scholarship, science, agriculture, and music during his reign."
  },
  {
    "name": "SonHeungmin",
    "profile": "Son Heung-min, a South Korean football player",
    "long": "Son Heung-min is a renowned South Korean footballer who represents his country as a forward. He has gained global recognition for his exceptional goal-scoring ability and skillful use of both feet. As the first Asian player to score 100 goals in the English Premier League and to win the Golden Boot, he has rewritten the history of Asian football."
  },
  {
    "name": "Faker",
    "profile": "Korean professional gamer Faker",
    "long": "Faker, whose real name is Lee Sang-hyeok, is a renowned South Korean eSports player widely regarded as the greatest professional gamer in the history of League of Legends (LoL). Since his debut in 2013, he has dominated international competitions with his exceptional mechanics and deep understanding of the game, serving as a key player for T1. He has won the LoL World Championship five times, setting legendary records and earning the admiration of fans worldwide. Through relentless self-discipline and dedication to his team, Faker has become an iconic figure in eSports and is credited with elevating the global status of South Korea's eSports scene."
  },
  {
    "name": "Hana",
    "profile": "Hana in the animation Dobot",
    "long": "Cha Hana is the pilot of the transforming robot Tobot X and the son of Dr. Do-un. He is a logical and calm fifth-grade student known for being a model pupil. He has a strong interest in math, science, and robot systems, and works alongside his twin brother Duri to pilot the Tobots and protect the city as a young hero. Tobot is a children’s animation series that follows the adventures of transforming robots who protect families and cities."
  },
  {
    "name": "YiSunSin",
    "profile": "YiSunSin, the great Korean man",
    "long": "Yi Sunsin was a military commander of the mid-Joseon Dynasty and a great general who defended Korea against Japanese invasions during the Imjin War. With outstanding strategy and naval leadership, he secured consecutive victories in major battles such as the Battle of Hansando, the Battle of Myeongnyang, and the Battle of Noryang, protecting the seas of Joseon. In particular, through his creative tactics and effective troop management—most notably his use of the turtle ship—he achieved remarkable victories despite being outnumbered. He remained on the battlefield until his final moment, ultimately falling in the Battle of Noryang."
  },
  {
    "name": "Heungbu",
    "profile": "Heungbu in Heungbu and Nolbu",
    "long": "Heungbu is a character from an old Korean village who grew up with his older brother, Nolbu. After the death of their parents, he was deprived of his inheritance and worked as a day laborer to support his large family. Despite living in poverty, he compassionately rescued and treated an injured swallow, and the following year, the swallow brought him a magical gourd seed. When planted, it yielded treasures and food, making him wealthy. He later played a significant role in his brother’s repentance, and is remembered as a patient and compassionate figure."
  }
]
